{
    "appealing_animation_timing": "Synchronize visual effects precisely with specific moments in music/audio to enhance impact.",
    "appealing_animation": "Appealing animation is one that is synchronized with the music. To beats, to bars, to lyrics, to the keypoint miliseconds in the song. this is a MUST. Always aligned with something.",
    "favorite_color": "purple",
    "color_preference": "hue shift of purple and orange",
    "pastel_preference": "likes pastel colors sometimes",
    "animation_preferences": "likes increasing fade-in effects in animations",
    "animation_style_preferences": "- Create a surprising animation with innovative combinations of effects\n- Use varied segment patterns (b1, b2, random, centric, updown, arc, ind)\n- Implement creative snake effects with different head and tail configurations\n- Incorporate step functions for brightness and hue changes",
    "beat_based_animation": "A reallllly good idea for animations is to sync with the beat of the music",
    "something_must_be_lighten": "Something must be lighten, like some element or part of an element, use dark scene very sparsly, only when it's really needed in the song, like building tension. Principle: Lighten something, use dark scene very sparsly",
    "efficient_animation": "A good animation is one that is efficient and doesn't use many effedcts on the SAME element, because it has hardware limitations, so instead you can animate different elements each time and it add interests to the viewer and still be efficient",
    "words_to_colors": "Nice animation can be to convert words to colors, like when he lyrics says 'sky', use blues plattes, when it says 'sand', use yellows, etc.",
    "smooth_transitions": "Achieve fluid visual flow by ensuring discernible similarity between consecutive effects. Principle: Intentional connection or shared attribute between elements for seamless flow.",
    "appealing_animation_timing": "Synchronize visual effects precisely with specific moments in music/audio to enhance impact. Principle: Visual rhythm should complement and amplify auditory rhythm.",
    "brightness_pulsing_sine_function": "Use the Sine function for dynamic, cyclical brightness effects with precise timing and repetition. Principle: Leverage mathematical functions for programmatic control over visual properties."
}
