{
    "favorite_color": "purple",
    "color_preference": "hue shift of purple and orange",
    "pastel_preference": "likes pastel colors sometimes",
    "animation_preferences": "likes increasing fade-in effects in animations",
    "animation_style_preferences": "- Create a surprising animation with innovative combinations of effects\n- Use varied segment patterns (b1, b2, random, centric, updown, arc, ind)\n- Implement creative snake effects with different head and tail configurations\n- Incorporate step functions for brightness and hue changes",
    "beat_based_animation": "A really good idea for animations is to sync with the beat of the music",
    "something_must_be_lighten": "Something must be lighten, like some element or part of an element, use dark scene very sparsly, only when it's really needed in the song, like building tension. Principle: Lighten something, use dark scene very sparsly",
    "efficient_animation": "A good animation is one that is efficient and doesn't use many effedcts on the SAME element, because it has hardware limitations, so instead you can animate different elements each time and it add interests to the viewer and still be efficient",
    "words_to_colors": "Nice animation can be to convert words to colors, like when he lyrics says 'sky', use blues plattes, when it says 'sand', use yellows, etc.",
    "smooth_transitions": "Achieve fluid visual flow by ensuring discernible similarity between consecutive effects. Principle: Intentional connection or shared attribute between elements for seamless flow.",
    "appealing_animation_timing": "Synchronize visual effects precisely with specific moments in music/audio to enhance impact. Principle: Visual rhythm should complement and amplify auditory rhythm.",
    "brightness_pulsing_sine_function": "Use the Sine function for dynamic, cyclical brightness effects with precise timing and repetition. Principle: Leverage mathematical functions for programmatic control over visual properties.",
    "hue_cycle_direction": "The correct direction of the rainbow gradient in the animation is orange-to-purple, not purple-to-orange. This is because when hue_start is set to 0.7 (purple) and hue_end is set to 0.1 (orange), the gradient actually moves through the color wheel in the shorter direction from orange to purple. The HSV color wheel goes from 0.0 (red) → 0.33 (green) → 0.67 (blue) → 1.0 (back to red). So a gradient from 0.1 to 0.7 moves through yellows and greens, while 0.7 to 0.1 moves through blues and reds, creating an orange-to-purple gradient.",
    "brightness_visibility_guideline": "Brightness (val) guidelines:\n- Values below 0.8 are essentially dark/invisible\n- Use 0.0 for complete darkness\n- Minimum visible brightness: 0.8\n- Recommended brightness range: 0.8 - 1.0 for clear, vibrant effects",
    "val_brightness_explanation": "In the HSV color model, the 'val' (value) field in const_color refers to the base brightness level of the color. It determines the overall luminosity of the color, ranging from 0.0 (completely dark/black) to 1.0 (full brightness). Always keep val above 0.8 to ensure visibility.",
    "animation_motion_principle": "Just const color is boring and static, usually it's better to add motion or brightness to create more engaging visual effects.",
    "animation_complexity_principle": "To create more engaging animations, combine const color with additional layers of effects like snake, hue shifts, brightness modulation, and other dynamic elements. Layering multiple effect types adds depth, movement, and visual interest to the animation.",
    "animation_element_variation_strategy": "Dynamic animation design principle: Strategically illuminate different elements across beats to create visual interest. In high-energy sections, implement frequent and rapid animation changes across multiple elements. For slower, more contemplative moments, transition more gradually and subtly between elements, maintaining a sense of smooth progression.",
    "layering_segments_technique": "Create visual depth by layering multiple effects with the same time frame but different segment targets. For example, if effect X uses 'segments: all' during [start_time_X, end_time_X], add another effect during the exact same time frame that targets a specific segment type (b1, b2, rand, etc.). The rendering system applies these sequentially, with later effects overriding the specific segments of earlier ones, creating rich visual complexity and interest.",
    "repeat_float_function_beat_sync_formula": "To sync effects with beats for a specific duration, calculate numberOfTimes as: (duration_seconds/60) × BPM. For example, for a 20-second segment in a 120 BPM song: (20/60) × 120 = 40 repeats.",
    "beat_calculation_formula": "To determine how many beats occur within a specific duration: (duration_seconds/60) × BPM. If duration is in milliseconds, convert first: (duration_ms/1000/60) × BPM.",
    "complete_beat_synchronization_method": "For perfect beat-synced animations, first determine the total number of beats in your animation duration, then set the repeat count to match exactly that number of beats.",
    "half_function_blinking_technique": "Create precise beat-synchronized blinking by nesting a half function (alternating between brightness 1.0 and 0.0) inside a repeat function with numberOfTimes matching the exact beat count.\nCreate precise beat-synchronized blinking by nesting a half function (alternating between brightness 1.0 and 0.0) inside a repeat function with numberOfTimes matching HALF the exact beat count. This is because each complete cycle of the half function (ON-OFF) spans two beats, so to align the ON state with each beat, use numberOfTimes = total_beats/2.",
    "sine_wave_visibility_range": "For sine wave functions in brightness effects, use a wider range between min and max values (e.g., 0.3-1.0 instead of 0.8-1.0) to create more noticeable pulsing effects. Narrow ranges like 0.8-1.0 produce subtle changes that are barely visible to viewers."
}